// Завдання 6
// Напиши скрипт який просить відвідувача ввести число в prompt до тих пір, поки відвідувач не натисне Cancel і кожен раз додає введене значення до загальної суми.
// При завантаженні сторінки користувачеві пропонується в prompt ввести число. Введення додається до значення змінної total.
// Операція введення числа триває до тих пір, поки користувач не натисне кнопку Cancel в prompt.
// Після того як користувач припинив введення натиснувши кнопку Cancel, показати alert з рядком 'Загальна сума чисел дорівнює [сума]'.
//  Робити перевірку того, що користувач ввів саме число, а не довільний набір символів, не потрібно. Якщо хочеш, в разі некоректного введення, показуй alert з текстом 'Було написано не число, спробуйте ще раз', при цьому результат prompt плюсувати до загальної суми не потрібно, після чого знову користувачеві пропонується ввести число в prompt.

let input = prompt("Enter the number");
let num = Number(input)
let numbers = []
let total = 0;
numbers.push(num)


while (input != null) {
    input = prompt("Enter the number");
    num = Number(input)
    numbers.push(num)

}


if (input == null) {
    for (let i = 0; i < numbers.length; i += 1) {
        total += numbers[i]

    }
    console.log(`Загальна сума чисел дорівнює ${total}`)
}