// Завдання 5
// Користувач може оформити доставку товару до себе в країну, вказавши її при відвідуванні сторінки в prompt. Врахуй, користувач може ввести ім'я країни не тільки буквами нижнього регістра, а наприклад 'кИтАЙ'.
// Напиши скрипт який виводить повідомлення про вартість доставки в зазначену країну. Обов'язково використовуй switch. Формат повідомлення: 'Доставка в [країна] буде коштувати [ціна] кредитів'.
// Але доставка є не скрізь, якщо зазначеної країни немає в списку, то виводь в alert повідомлення 'У вашій країні доставка недоступна'.
// Нижче наведено список країн і вартість доставки.
// Китай - 100 кредитів
// Чилі - 250 кредитів
// Австралія - 170 кредитів
// Індія - 80 кредитів
// Ямайка - 120 кредитів

let input = prompt("Уведіть країну").toLowerCase();
let credits

switch (input) {
    case "китай":
        credits = 100
        input = input[0].toUpperCase() + input.slice(1)
        alert(`Доставка в ${input} буде коштувати ${credits} кредитів`)
        break;
    case "чилі":
        credits = 250
        input = input[0].toUpperCase() + input.slice(1)
        alert(`Доставка в ${input} буде коштувати ${credits} кредитів`)
        break;
    case "австралія":
        credits = 170
        input = input[0].toUpperCase() + input.slice(1)
        alert(`Доставка в ${input} буде коштувати ${credits} кредитів`)
        break;
    case "індія":
        credits = 80
        input = input[0].toUpperCase() + input.slice(1)
        alert(`Доставка в ${input} буде коштувати ${credits} кредитів`)
        break;
    case "ямайка":
        credits = 120
        input = input[0].toUpperCase() + input.slice(1)
        alert(`Доставка в ${input} буде коштувати ${credits} кредитів`)
        break;

    default:
        alert('У вашій країні доставка недоступна')
        break;
}